#### Terraform Plan
```
scaleway_container_namespace.main: Refreshing state... [id=fr-par/d47f2603-58f0-4785-8bac-98cefa208372]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # scaleway_container.service["app"] will be created
  + resource "scaleway_container" "service" {
      + cpu_limit             = 500
      + cron_status           = (known after apply)
      + deploy                = true
      + domain_name           = (known after apply)
      + environment_variables = (known after apply)
      + error_message         = (known after apply)
      + http_option           = "redirected"
      + id                    = (known after apply)
      + local_storage_limit   = (known after apply)
      + max_concurrency       = (known after apply)
      + max_scale             = 10
      + memory_limit          = 256
      + min_scale             = 0
      + name                  = "testinfrarepo-app"
      + namespace_id          = (known after apply)
      + port                  = 8080
      + privacy               = "public"
      + protocol              = "http1"
      + registry_image        = (known after apply)
      + sandbox               = (known after apply)
      + status                = (known after apply)
      + timeout               = 300

      + health_check (known after apply)

      + scaling_option {
          + concurrent_requests_threshold = 50
        }
    }

  # scaleway_container_namespace.main must be replaced
-/+ resource "scaleway_container_namespace" "main" {
      ~ description                  = "Serverless container namespace for TestInfraRepo" -> "Serverless container namespace for testinfrarepo"
      - environment_variables        = {} -> null
      ~ id                           = "fr-par/d47f2603-58f0-4785-8bac-98cefa208372" -> (known after apply)
      ~ name                         = "TestInfraRepo" -> "testinfrarepo" # forces replacement
      ~ organization_id              = "a62338e3-5bcc-4ef9-8c54-06096f4a85f0" -> (known after apply)
      ~ project_id                   = "a62338e3-5bcc-4ef9-8c54-06096f4a85f0" -> (known after apply)
      - region                       = "fr-par" -> null
      ~ registry_endpoint            = "rg.fr-par.scw.cloud/funcscwtestinfrarepopwm6q2qa" -> (known after apply)
      ~ registry_namespace_id        = "c5430a80-10f6-416c-8d4f-d65df4de0259" -> (known after apply)
      - secret_environment_variables = (sensitive value) -> null
      - tags                         = [] -> null
        # (2 unchanged attributes hidden)
    }

  # scaleway_registry_namespace.main will be created
  + resource "scaleway_registry_namespace" "main" {
      + description     = "Container registry for testinfrarepo"
      + endpoint        = (known after apply)
      + id              = (known after apply)
      + is_public       = false
      + name            = "testinfrarepo"
      + organization_id = (known after apply)
      + project_id      = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + container_ids     = {
      + app = (known after apply)
    }
  + container_urls    = {
      + app = (known after apply)
    }
  + registry_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
*Triggered by @skepptestah[bot]*